esden/stm32cube-database/db/mcu/memory/STM32_DIE485_620_64.xml
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<rzone xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="0.2.0" xs:noNamespaceSchemaLocation="AMC_rzone.xsd">

  <device Dname="STM32H7RS-64K" Dvendor="STMicroelectronics:13" info="ARM Cortex-M7, 620 KB RAM, 64 KB FLASH">
    <package info="STMicroelectronics STM32H7 Series Device Support" name="STM32H7xx_DFP" url="http://www.st.com/" vendor="STMicroelectronics" version="0.0.1-dev1"/>
    <processor Dclock="250000000" Dcore="ARM Cortex-M7" DcoreVersion="r1p2_REL" Ddsp="DSP" Dendian="Little-endian" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" DnumInterrupts="" DnumMpuRegions="16" SubRegions="8"/>
  </device>

  <resources>

    <memories>
      <memory access="rwx" info="ITCM memory" name="RAM_ITCM" size="0x00010000" start="0x00000000" type="RAM"/>
      <memory access="rx" info="Flash memory" name="Flash" size="0x00010000" start="0x08000000" type="ROM"/>
      <memory access="rx" info="System memory" name="System" size="0x00020000" start="0x1FF00000" type="ROM"/>

      <memory access="rwx" info="DTCM memory" name="RAM_DTCM" size="0x00010000" start="0x20000000" type="RAM"/>
      <memory access="rwx" info="AXI SRAM1" name="RAM1_AXI" size="0x00020000" start="0x24000000" type="RAM"/>
      <memory access="rwx" info="AXI SRAM2" name="RAM2_AXI" size="0x00020000" start="0x24020000" type="RAM"/>
      <memory access="rwx" info="AXI SRAM3" name="RAM3_AXI" size="0x00020000" start="0x24040000" type="RAM"/>
      <memory access="rwx" info="AXI SRAM4" name="RAM4_AXI" size="0x00012000" start="0x24060000" type="RAM"/>
      <memory access="rwx" info="AHB SRAM1" name="RAM1_AHB" size="0x00004000" start="0x30000000" type="RAM"/>
      <memory access="rwx" info="AHB SRAM2" name="RAM2_AHB" size="0x00004000" start="0x30004000" type="RAM"/>
      <memory access="rwx" info="Backup SRAM" name="BKPSRAM" size="0x00001000" start="0x38800000" type="RAM"/>

      <provisioning info="FMC Bank1" name="FMC NOR Bank1" size="0x10000000" start="0x60000000"/>
      <provisioning info="XSPI2" name="XSPI2" size="0x10000000" start="0x70000000"/> 
      <provisioning info="FMC Bank3" name="FMC NAND Bank3" size="0x10000000" start="0x80000000"/>
      <provisioning info="XSPI1" name="XSPI1" size="0x10000000" start="0x90000000"/>

      <provisioning info="FMC SDRAM Bank1" name="FMC SDRAM Bank1" size="0x10000000" start="0xC0000000"/>
      <provisioning info="FMC SDRAM Bank2" name="FMC SDRAM Bank2" size="0x10000000" start="0xD0000000"/>

    </memories>

   </resources>

</rzone>
